app/controllers/ingredients_controller.rb

  def load_recipe
    @recipe = Recipe.find(params[:recipe_id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 2)

  def index
    @ingredients = Ingredient.all
---
SELECT * FROM "ingredients"

  def edit
    @ingredient = Ingredient.find(params[:id])
---
SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 2)

  def create
    @ingredient = Ingredient.new(params[:ingredient])
    @recipe.ingredients << @ingredient
---
INSERT INTO "ingredients" ("name", "created_at", "quantity", "recipe_id", "updated_at", "unit_of_measure") VALUES('test', '2010-03-04 19:38:27', 2.0, NULL, '2010-03-04 19:38:27', 'cups')

  def update
    @ingredient = Ingredient.find(params[:id])

    respond_to do |format|
      if @ingredient.update_attributes(params[:ingredient])
---
SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 2)
UPDATE "ingredients" SET "updated_at" = '2010-03-04 20:07:58', "deleted" = 'f' WHERE "id" = 2

  def destroy
    @ingredient = Ingredient.find(params[:id])
---
SELECT * FROM "ingredients" WHERE ("ingredients"."id" = 2)