app/controllers/recipes_controller.rb

SELECT * FROM "recipes" WHERE (updated_at >= '2010-03-03 17:46:42')
---
  def index
    @recipes = Recipe.from(params[:last]).all

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
---
  def show
    @recipe = Recipe.find(params[:id])

INSERT INTO "recipes" ("course", "created_at", "title", "updated_at", "deleted", "serves", "desc") VALUES('Appetizer', '2010-03-04 19:29:37', 'Little Smokies', '2010-03-04 19:29:37', 'f', 4, '1 Bottle of Kraft Honey Barbecue Sauce
---
  def create
    @recipe = Recipe.new(params[:recipe])

    respond_to do |format|
      if @recipe.save

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
UPDATE "recipes" SET "updated_at" = '2010-02-27 20:26:22', "title" = 'mud pie' WHERE "id" = 1
---
  def update
    @recipe = Recipe.find(params[:id])

    respond_to do |format|
      if @recipe.update_attributes(params[:recipe])

SELECT * FROM "recipes" WHERE ("recipes"."id" = 1)
---
  def destroy
    @recipe = Recipe.find(params[:id])